client/models soap/Extrato/SaveRecord

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>FinXCXData</tot:DataServerName>
         <!--Optional:-->
         <tot:XML><![CDATA[<FinXCX>
  <FXCX>
    <CODCOLIGADA>1</CODCOLIGADA>
    <IDXCX>1860</IDXCX>
    <NUMERODOCUMENTO>2601120771</NUMERODOCUMENTO>
    <TIPO>2</TIPO>
    <COMPENSADO>1</COMPENSADO>
    <RECONCILIADO>1</RECONCILIADO>
    <STATUSEXPORTACAO>0</STATUSEXPORTACAO>
    <HISTORICO>Boleto de cobranca recebido: "112/90553567325"</HISTORICO>
    <CODCOLCXA>1</CODCOLCXA>
    <CODCXA>MEUERP01</CODCXA>
    <CODFILIAL>1</CODFILIAL>
    <VALOR>977.9000</VALOR>
    <VALORCONTABIL>977.9000</VALORCONTABIL>
    <VALOREMREAIS>977.9000</VALOREMREAIS>
    <DATA>2026-01-12T00:00:00</DATA>
    <DATACOMPENSACAO>2026-01-12T00:00:00</DATACOMPENSACAO>
    <CONTABIL>0</CONTABIL>
    <ECHEQUE>0</ECHEQUE>
    <PREDATADO>0</PREDATADO>
    <CHEQUEIMPRESSO>0</CHEQUEIMPRESSO>
    <TIPOCUSTODIA>0</TIPOCUSTODIA>
    <ESTORNADO>0</ESTORNADO>
    <LIBERACAOAUTORIZADA>0</LIBERACAOAUTORIZADA>
    <USUARIOCRIACAO>mestre</USUARIOCRIACAO>
    <STATUSORCAMENTO>0</STATUSORCAMENTO>
    <MODELOCONTABILIZACAO>0</MODELOCONTABILIZACAO>
    <STATUSAVP>0</STATUSAVP>
    <STATUSESTORNO>0</STATUSESTORNO>
  </FXCX>
  <FXCXCOMPL>
    <CODCOLIGADA>1</CODCOLIGADA>
    <IDXCX>1860</IDXCX>
  </FXCXCOMPL>
</FinXCX>]]></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODCOLIGADA=1;CODUSUARIO='mestre';CODSISTEMA=F</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>